<?php
	/**
	 *
	 * 華南銀行 台灣PAY 回覆代碼說明
	 *
	 */
	function hncbRespCodeMessage($respCode)
	{
		$map = [
			'EEEE' => '銀行端系統暫停服務',
			'0000' => '正常回應交易成功',
			'9999' => '交易處理中',
			'0018' => '驗證碼錯誤',
			
			'0001' => '訊息被MESSAGE SENDER認可',
			'0101' => '訊息格式或內容編輯錯誤',
			'0102' => '無效之回應代碼',
			'0104' => '財金公司與第三參加單位間之訊息發生一般檢核類之錯誤。',
			'0108' => '財金公司切換CD/ATM轉帳作業營業日至跨行結帳時段，財金公司檢核轉帳通知訊息之RESPONSE CODE非0001。',
			
			'0201' => '財金公司檢核發信單位未參加該跨行業務。',
			'0202' => '發信單位該項跨行業務停止或暫停營業',
			'0203' => '發信單位主機未在跨行作業運作狀態',
			'0204' => '財金公司檢核收信單位未參加該跨行業務。',
			'0205' => '收信單位該項跨行業務停止或暫停營業',
			'0206' => '收信單位主機未在跨行作業運作狀態',
			'0207' => '收信單位今日不營業',

			'0301' => '押碼基碼SYNC不同步',
			'0302' => '訊息押碼MAC錯誤',

			'0401' => '訊息之MAPPING欄位資料與原交易相關訊息之欄位資料不相符。',
			'0501' => '端末機故障',
			'0601' => '交易訊息發生TIMEOUT，需利用相關交易明細查詢，查詢結果。',

			'0701' => '財金公司該項跨行業務暫停或停止營業',
			'0702' => '財金公司主機未在跨行作業運作狀態',
			'0703' => '財金公司該跨行業務系統錯誤',

			'0801' => '檔案故障',

			'1001' => '無效之訊息類別代碼MESSAGE TYPE或交易類別代碼PCODE',
			'1002' => '跨行交易之TRACE NUMBER重複',
			'1003' => '訊息與原跨行交易之執行狀態不符',
			'1004' => '訊息內之STAN FORMAT錯誤',
			'1005' => '訊息發送者ID.與訊息內之TXN. SOURCE INSTITUTE ID.或TXN. DESTINATION ID.不符',
			'1006' => '財金公司檢核訊息之BIT MAP結構與該訊息不相符。',

			'2999' => '其他類檢核錯誤',
			'4001' => '交易成功',

			'4201' => '提款、轉帳、圈存、預先授權、授權完成等交易之金額超過每次限額。',
			'4202' => '提款、圈存、預先授權、授權完成等交易之累計金額超過累計限額，或金融卡國際提款交易金額超過限額。',
			'4203' => '提款、圈存、預先授權、授權完成等交易金額或金融卡國際提款交易金額錯誤。',
			
			'4401' => '失效卡片，不更新磁軌且不留置卡片。',
			'4405' => '卡片尚未生效',
			'4406' => '卡片已掛失，不更新磁軌且不留置卡片。',
			'4414' => '卡號有誤。',

			'4501' => '該卡片之帳戶為問題帳戶，不更新磁軌且不留置卡片。',
			'4505' => '帳戶可用餘額不足，不更新磁軌且不留置卡片。',
			'4507' => '轉入帳戶狀況檢核',
			'4508' => '非約定之轉帳帳戶',

			'4601' => '提款累計次數超過累計限制次數，或國際信用卡交易累計次數超過限制次數，需進行人工授權交易。',
			'4701' => '無此交易。',
			'4702' => '交易狀況不明或 Protocal錯誤。',

			'4801' => '繳款類別有誤；未經註冊之繳費交易',
			'4802' => '銷帳編號檢查碼有誤',
			'4803' => '繳款金額有誤',
			'4804' => '繳款期限有誤；逾期／未到',
			'4805' => '事業機構代號有誤',
			'4806' => '身份証號／營利事業統一編號有誤',
			'4807' => '入帳單位有誤',

			'5004' => '中文欄位或變動長度欄位長度錯誤。',
			'6101' => '跨行可用餘額小於零，不得交易。',
			'8037' => '購貨日期錯誤',

			'8101' => '交易IC金融卡交易驗證碼檢核錯誤。',
			'8104' => 'IC金融卡交易序號重覆',
			'8108' => 'IC卡片序號錯誤，回發卡單位處理',
			'8115' => 'IC卡備註欄位檢核有誤',

			'QR01' => '訂單編號重覆退款[退款訊息]',
			'QR02' => '訂單編號正本重覆退款[退款訊息]',
			'QR03' => '訂單編號正本重覆付款[付款訊息]',
		];

		return $map[$respCode] ?? '未知的交易回覆代碼';
	}

?>
